# 580. Count Student Number in Departments

 A university uses 2 data tables, student and department, to store data about its students and the departments associated with each major.

Write a query to print the respective department name and number of students majoring in each department for all departments in the department table (even ones with no current students).

Sort your results by descending number of students; if two or more departments have the same number of students, then sort those departments alphabetically by department name.

The student is described as follow:

Column Name	Type
student_id	Integer
student_name	String
gender	Character
dept_id	Integer
where student_id is the student’s ID number, student_name is the student’s name, gender is their gender, and dept_id is the department ID associated with their declared major.

And the department table is described as below:

Column Name	Type
dept_id	Integer
dept_name	String
where dept_id is the department’s ID number and dept_name is the department name.

Here is an example input:
student table:

student_id	student_name	gender	dept_id
1	        Jack	        M	     1
2	        Jane	        F        1
3	        Mark	        M	     2
department table:

dept_id	dept_name
1	    Engineering
2	    Science
3	    Law
The Output should be:

dept_name	student_number
Engineering	  2
Science    	  1
Law	          0

In [2]:
import pandas as pd
import re
import numpy as np
student= pd.DataFrame({'student_id':[1,2,3],'student_name':['Jack','Jane','Mark'],'gender':['M','F','M'],'dept_id':[1,1,2]})
student=student[['student_id','student_name','gender','dept_id']]
student

   student_id student_name gender  dept_id
0           1         Jack      M        1
1           2         Jane      F        1
2           3         Mark      M        2

In [4]:
department= pd.DataFrame({'dept_id':[1,2,3],'dept_name':['Engineering','Science','Law']})
department=department[['dept_id','dept_name']]
department

   dept_id    dept_name
0        1  Engineering
1        2      Science
2        3          Law

In [13]:
s1=student.groupby('dept_id').size().to_frame('number').reset_index()
s1

   dept_id  number
0        1       2
1        2       1

In [14]:
output=pd.merge(department,s1,on='dept_id',how='left')
output

   dept_id    dept_name  number
0        1  Engineering     2.0
1        2      Science     1.0
2        3          Law     NaN

In [15]:
output1=output.replace('nan', np.nan).fillna(0)
output1

   dept_id    dept_name  number
0        1  Engineering     2.0
1        2      Science     1.0
2        3          Law     0.0

In [17]:
output1['student_number']=output1.number.astype(int)

In [19]:
print(output1[['dept_name','student_number']].to_string(index=False))

dept_name  student_number
Engineering               2
    Science               1
        Law               0

# 584. Find Customer Referee

Given a table customer holding customers information and the referee.

+------+------+-----------+
| id   | name | referee_id|
+------+------+-----------+
|    1 | Will |      NULL |
|    2 | Jane |      NULL |
|    3 | Alex |         2 |
|    4 | Bill |      NULL |
|    5 | Zack |         1 |
|    6 | Mark |         2 |
+------+------+-----------+
Write a query to return the list of customers NOT referred by the person with id ‘2’.

For the sample data above, the result is:

+------+
| name |
+------+
| Will |
| Jane |
| Bill |
| Zack |
+------+

In [3]:
import pandas as pd
import re
import numpy as np
customers= pd.DataFrame({'id':[1,2,3,4,5,6],'name':['Will','Jane',' Alex','Bill','Zack','Mark'],
                         'referee_id':['NULL','NULL',2,'NULL',1,2]})
customers=customers [['id','name','referee_id']]
customers

   id   name referee_id
0   1   Will       NULL
1   2   Jane       NULL
2   3   Alex          2
3   4   Bill       NULL
4   5   Zack          1
5   6   Mark          2

In [8]:
print(customers[~customers.referee_id.isin([2])][['name']].to_string(index=False))

name
Will
Jane
Bill
Zack

# 585. Investments in 2016

Write a query to print the sum of all total investment values in 2016 (TIV_2016), to a scale of 2 decimal places,
for all policy holders who meet the following criteria:

Have the same TIV_2015 value as one or more other policyholders.
Are not located in the same city as any other policyholder (i.e.: the (latitude, longitude) attribute pairs must be unique).
Input Format:
The insurance table is described as follows:

Column Name	Type
PID	INTEGER(11)
TIV_2015	NUMERIC(15,2)
TIV_2016	NUMERIC(15,2)
LAT	NUMERIC(5,2)
LON	NUMERIC(5,2)
where PID is the policyholder’s policy ID, TIV_2015 is the total investment value in 2015, TIV_2016 is the total investment 
value in 2016, LAT is the latitude of the policy holder’s city, and LON is the longitude of the policy holder’s city.

Sample Input
PID	TIV_2015	TIV_2016  LAT	  LON
1	10     	    5	      10	  10
2	20	        20	      20	  20
3	10	        30	      20	  20
4	10	        40	      40	  40
Sample Output

TIV_2016
45.00

In [1]:
import pandas as pd
import re
import numpy as np
insurance= pd.DataFrame({'PID':[1,2,3,4],'TIV_2015':[10,20,10,10],'TIV_2016':[5,20,30,40],'LAT':[10,20,20,40],'LON':[10,20,20,40]})
insurance=insurance[['PID','TIV_2015','TIV_2016','LAT','LON']]
insurance

   PID  TIV_2015  TIV_2016  LAT  LON
0    1        10         5   10   10
1    2        20        20   20   20
2    3        10        30   20   20
3    4        10        40   40   40

In [7]:
in1=insurance.groupby('TIV_2015').size().to_frame('count').reset_index()
in1

   TIV_2015  count
0        10      3
1        20      1

In [31]:
in1[in1['count']>1].TIV_2015.tolist()

[10]

In [23]:
insurance['latlon'] = insurance['LAT'].astype(str) + insurance['LON'].astype(str)
insurance

   PID  TIV_2015  TIV_2016  LAT  LON latlon
0    1        10         5   10   10   1010
1    2        20        20   20   20   2020
2    3        10        30   20   20   2020
3    4        10        40   40   40   4040

In [29]:
in2=insurance.groupby('latlon').size().to_frame('cc').reset_index()
in2[in2['cc']>1].latlon.tolist()

  latlon  cc
1   2020   2

In [40]:
insurance.TIV_2015.isin(in1[in1['count']>=1].TIV_2015.tolist())

0    True
1    True
2    True
3    True
Name: TIV_2015, dtype: bool

In [42]:
insurance.latlon.isin(in2[in2['cc']==1].latlon.tolist())

0     True
1    False
2    False
3     True
Name: latlon, dtype: bool

In [44]:
output=insurance[(insurance.TIV_2015.isin(in1[in1['count']>=1].TIV_2015.tolist()))&(insurance.latlon.isin(in2[in2['cc']==1].latlon.tolist()))]
output

   PID  TIV_2015  TIV_2016  LAT  LON latlon
0    1        10         5   10   10   1010
3    4        10        40   40   40   4040

In [60]:
output.TIV_2016.sum(axis=0)

45

In [62]:
output.agg({'TIV_2016':[sum]})

     TIV_2016
sum        45

# 586. Customer Placing the Largest Number of Orders

Query the customer_number from the orders table for the customer who has placed the largest number of orders.

It is guaranteed that exactly one customer will have placed more orders than any other customer.

The orders table is defined as follows:

Column	Type
order_number (PK)	int
customer_number	int
order_date	date
required_date	date
shipped_date	date
status	char(15)
comment	char(200)
Sample Input

order_number	customer_number	order_date	required_date	shipped_date	status	comment
1	            1	            2017-04-09  2017-04-13	    2017-04-12	    Closed	
2	            2	            2017-04-15	2017-04-20	    2017-04-18	    Closed	
3	            3	            2017-04-16	2017-04-25	    2017-04-20	    Closed	
4	            3	            2017-04-18	2017-04-28	    2017-04-25	    Closed	
Sample Output 

customer_number
3
Explanation

The customer with number ‘3’ has two orders, which is greater than either customer ‘1’ or ‘2’ because each of them only has 
one order.
So the result is customer_number ‘3’.

In [5]:
import pandas as pd
import re
import numpy as np
orders=pd.DataFrame({'order_number':[1,2,3,4],'customer_number':[1,2,3,3],'order_date':['2017-04-09','2017-04-15',
'2017-04-16','2017-04-18'],'required_date':['2017-04-13','2017-04-20','2017-04-25','2017-04-28'],'shipped_date':
['2017-04-12','2017-04-18','2017-04-20','2017-04-25'],'status':['Closed','Closed','Closed','Closed']})
orders=orders[['order_number','customer_number','order_date','required_date','shipped_date','status']]
orders

,order_number,customer_number,order_date,required_date,shipped_date,status
0,1,1,2017-04-09,2017-04-13,2017-04-12,Closed
1,2,2,2017-04-15,2017-04-20,2017-04-18,Closed
2,3,3,2017-04-16,2017-04-25,2017-04-20,Closed
3,4,3,2017-04-18,2017-04-28,2017-04-25,Closed

In [12]:
output=orders.groupby('customer_number').size().to_frame('cc').reset_index()
output

   customer_number  cc
0                1   1
1                2   1
2                3   2

In [10]:
type(orders.groupby('customer_number').size().max())

numpy.int64

In [17]:
o1=output[output.cc.isin([orders.groupby('customer_number').size().max()])]
o1

   customer_number  cc
2                3   2

In [18]:
o1[['customer_number']]

   customer_number
2                3

In [19]:
print(o1[['customer_number']].to_string(index=False))

customer_number
              3